DROP DATABASE IF EXISTS test;

CREATE DATABASE test;

USE test;

CREATE TABLE `notes`
(
	`id` INT(8) NOT NULL AUTO_INCREMENT,
	`text` VARCHAR(255) NOT NULL DEFAULT '0',
	`isExecuted` BIT(1) NOT NULL DEFAULT b'0',
	`createdDate` TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
	PRIMARY KEY (`id`)
)
COLLATE='utf8_general_ci';
INSERT INTO `notes` (`id`,`text`,`isExecuted`,`createdDate`) VALUES (1,"Забрать обувь",b'0',"2017-10-08 16:50:27"),
(2,"Приготовить еду",b'0',"2017-10-08 15:40:27"),
(3,"Сходить в кино",b'0',"2017-10-07 12:00:27"),
(4,"Купить еду",b'0',"2017-10-07 15:10:27"),
(5,"Купить еду",b'0',"2017-10-07 15:10:27"),
(6,"Купить еду",b'0',"2017-10-07 15:10:27"),
(7,"Купить еду",b'0',"2017-10-07 15:10:27"),
(8,"Купить еду",b'0',"2017-10-07 15:10:27"),
(9,"Приготовить еду",b'0',"2017-10-08 13:50:27"),
(10,"Купить еду",b'0',"2017-10-07 15:10:27"),
(11,"Купить еду",b'0',"2017-10-07 15:10:27"),
(12,"Купить еду",b'0',"2017-10-07 15:10:27"),
(13,"Приготовить еду",b'0',"2017-10-08 15:10:27"),
(14,"Купить еду",b'1',"2017-10-09 15:10:27"),
(15,"Купить еду",b'0',"2017-10-07 15:10:27"),
(16,"Купить еду",b'0',"2017-10-07 15:10:27"),
(17,"Купить еду",b'0',"2017-10-07 15:10:27"),
(18,"Купить еду",b'1',"2017-10-10 15:10:27"),
(19,"Купить еду",b'0',"2017-10-07 15:10:27"),
(20,"Купить еду",b'0',"2017-10-12 15:10:27"),
(21,"Купить еду",b'0',"2017-10-07 15:10:27"),
(22,"Купить еду",b'0',"2017-10-07 15:10:27"),
(23,"Купить еду",b'0',"2017-10-14 15:10:27"),
(24,"Купить еду",b'0',"2017-10-07 15:10:27"),
(25,"Купить еду",b'0',"2017-10-07 15:10:27");
